//題目:求指定數之間2的倍數之和

#include <stdio.h>
int main()
{
	//設定輸入
	
	//unsigned int i;
	//unsigned int j;
	//printf("請輸入起始整數i與終點正整數j:");
	//scanf_s("%u%u", &i, &j);
	unsigned int i=1;
	unsigned int j=10;

	//---------------------------------------------------------
	/*計算過程，每個數%2為0計算一次，問題0，1%2=0無法計算*/
	//先判斷i是否有0，1
	int sum = 0;
	
	/*其實不用特判
	if(i==0&&j==1){
		sum = i-1;
		for (i ;i <= j;i++) {
			if (i%2 == 0) {
				sum = 0 ;
			}
		}
	}
	else if (i==0) {
		sum = i ;
		for (i;i <= j;i++) {
			if (i % 2 == 0) {
				sum +=i;
			}
		}
	}
	else if (i == 1) {
		sum = i - 1;
		for (i;i <= j;i++) {
			if (i % 2 == 0) {
				sum += i;
			}
		}
	}
	else {
		sum = 0;
		for (i;i <= j;i++) {
			if (i % 2 == 0) {
				sum += i;
			}
		}
	}
	*/
	//請直接
	for (i; i <= j; i++)
	{
		if (i % 2 == 0)
		{
			sum += i;
		}
	}
	
	//---------------------------------------------------------
	//輸出結果
	printf("2的倍數之和為:%d\n", sum);
	//---------------------------------------------------------
	// 第二題:嵌套用法，打印99乘法表
	int n ;
	int m ;
	for (n=1; n <= 9;n++) {//n先取1，然後取2
		for (m=1;m <= n;m++) {//在n取1後m取1，在n取2後m取1、2
			printf("%d*%d=%d ", m, n,n*m);
		}
		printf("\n");
	}
	//第三題:輸入2數，給定最大公約數
	// 用輾轉相除ex:24/18=1...6，18/6=3...0，最大公約數為6
	//12/8=1...4，8/4=2...0，最大公約數為4
	int x=24;
	int y = 18;
	int z = 0;
	
	while ( y != 0) {
		z = x % y;
		x = y;
		y = z;
	}
	printf("最大公約數是%d\n", x);
	//第四題:統計1~100數字9出現的次數
	//9的判斷條件9、19、29、39、...91~99，數字%10=9為答案?
	//1.9~89數字%10=9為答案，2.91~99/10=9為答案
	int num = 1;
	int count = 0;
	for (num; num <= 100;num++) {
		if (num%10==9&& num/10==9) {//抓出99
			count=count+2;
		}
		else if (num % 10 == 9 || num / 10 == 9) {//99以外
			count++;
		}
	}
	printf("總共有%d次9", count);



	return 0;
}